# =============
# macOS Development Environment Brewfile
# =============
#
# This file is managed by Ansible and defines all packages to install via
# Homebrew. It follows the specification in docs/specifications.md
#
# Usage: brew bundle --file=Brewfile
# -------------

# -------------
# Taps (Third-party Repositories)
# -------------
tap "hashicorp/tap"           # HashiCorp packages (Terraform, Packer, etc.)

# -------------
# Package Managers
# -------------
brew "mas"                    # Mac App Store CLI

# -------------
# Shell Environment
# -------------
brew "zsh"                    # Modern shell (local use)
brew "bash"                   # Portable shell (remote compatibility)
brew "starship"               # Cross-shell prompt

# -------------
# Core System Tools
# -------------
brew "ansible"                # Automation tool

# -------------
# Terminal & Multiplexing
# -------------
cask "alacritty"              # GPU-accelerated terminal emulator
brew "tmux"                   # Multiplexer
cask "font-fira-code-nerd-font"    # FiraCode with Nerd Font icons
cask "font-jetbrains-mono-nerd-font" # For starship
cask "font-hack-nerd-font"    # For starship (terminal icons)

# -------------
# CLI Tools & Utilities
# -------------
brew "fzf"                    # Fuzzy finder
brew "ripgrep"                # Fast code search (rg) (neovim telescope requires)
brew "fd"                     # Modern find replacement (neovim telescope would like)
brew "bat"                    # Cat with syntax highlighting
brew "eza"                    # Modern ls replacement
brew "zoxide"                 # Smart cd replacement
brew "tldr"                   # Simplified man pages
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor
brew "mtr"                    # Network diagnostics
brew "doggo"                  # DNS client
brew "curlie"                 # Curl with httpie syntax
brew "httpie"                 # HTTP client
brew "mosh"                   # Mobile shell (better SSH)

# -------------
# Window Management
# -------------
brew "koekeishiya/formulae/yabai"      # Tiling window manager
brew "koekeishiya/formulae/skhd"       # Hotkey daemon
tap "FelixKratz/formulae"              # SketchyBar tap
brew "FelixKratz/formulae/sketchybar"  # Custom menu bar
cask "karabiner-elements"              # Keyboard customization
cask "hammerspoon"                     # Automation engine
cask "jordanbaird-ice"                 # Manages icon visibility

# -------------
# API Development
# -------------
cask "httpie-desktop"         # httpie CLI in CLI Tools section

# -------------
# Text Editors & IDEs
# -------------
brew "neovim"                 # Modern vim with Lua support
cask "visual-studio-code"     # VS Code editor

# -------------
# Version Control & Git Tools
# -------------
brew "git"                    # Version control
brew "lazygit"                # Terminal UI for git
brew "git-delta"              # Better diff viewer
brew "gh"                     # GitHub CLI
brew "tig"                    # Text-mode interface for git

# -------------
# Language Runtimes & Version Managers
# -------------
brew "pyenv"                  # Python version management
brew "poetry"                 # Python dependency management
brew "pipx"                   # Install Python apps in isolated environments
brew "fnm"                    # Fast Node.js version manager
brew "node"                   # JS runtime env. 
brew "npm"                    # JS package manager
brew "python3"                # Python
brew "direnv"                 # Automatic environment variable loading

# -------------
# Containers & Virtualization
# -------------
brew "colima"                 # Container runtime
brew "podman"                 # Container CLI
cask "utm"                    # Virtual machine manager (QEMU frontend)

# -------------
# Infrastructure as Code
# -------------
brew "terraform"              # Infrastructure provisioning
brew "terraform-docs"         # Generate documentation from Terraform
brew "tflint"                 # Terraform linter
brew "tfsec"                  # Terraform security scanner
brew "ansible-lint"           # Ansible best practices checker
brew "hashicorp/tap/packer"   # Image creation tool (from HashiCorp tap)

# -------------
# Database Tools
# -------------
brew "mycli"                  # MySQL CLI with autocomplete
brew "pgcli"                  # PostgreSQL CLI with autocomplete

# -------------
# Monitoring & System Tools
# -------------
brew "btop"                   # System monitor
cask "stats"                  # Menu bar system monitor
brew "glances"                # Alternative system monitor

# -------------
# Productivity & Utilities
# -------------
cask "maccy"                  # Clipboard manager
cask "aldente"                # Battery charge limiter

# -------------
# Notes & Documentation
# -------------
cask "obsidian"               # Markdown-based notes
# TODO: find a good offline docs 

# -------------
# File Management
# -------------
cask "keka"                   # Archive utility

# -------------
# Browsers
# -------------
cask "firefox"                # Firefox Developer Edition
cask "google-chrome"          # Chrome browser

# -------------
# Security & Secrets
# -------------
cask "bitwarden"              # Password manager

# -------------
# Media & Entertainment
# -------------
cask "spotify"                # Music streaming
cask "shottr"                 # Screenshot tool

# -------------
# PAID SOFTWARE
# -------------
cask "alfred"                 # Launcher/automation
cask "fork"                   # Git GUI
cask "tableplus"              # Universal database GUI
cask "little-snitch"          # Network firewall
cask "fastrawviewer"          # RAW and JPEG image viewer

