# ==============================================================================
# macOS Development Environment Brewfile
# ==============================================================================
# This file is managed by Ansible and defines all packages to install via
# Homebrew. It follows the specification in docs/specifications.md
#
# Usage: brew bundle --file=Brewfile
# ==============================================================================

# ------------------------------------------------------------------------------
# Package Managers
# ------------------------------------------------------------------------------
brew "mas"                    # Mac App Store CLI

# ------------------------------------------------------------------------------
# CLI Tools & Utilities
# ------------------------------------------------------------------------------
brew "fzf"                    # Fuzzy finder
brew "ripgrep"                # Fast code search (rg)
brew "fd"                     # Modern find replacement
brew "bat"                    # Cat with syntax highlighting
brew "eza"                    # Modern ls replacement
brew "zoxide"                 # Smart cd replacement
brew "tldr"                   # Simplified man pages
brew "jq"                     # JSON processor
brew "yq"                     # YAML processor
brew "mtr"                    # Network diagnostics
brew "dog"                    # DNS client
brew "curlie"                 # Curl with httpie syntax
brew "httpie"                 # HTTP client
brew "mosh"                   # Mobile shell (better SSH)

# ------------------------------------------------------------------------------
# Core System Tools
# ------------------------------------------------------------------------------
brew "ansible"                # Automation tool
brew "git"                    # Version control

# ------------------------------------------------------------------------------
# Shell Environment
# ------------------------------------------------------------------------------
brew "zsh"                    # Modern shell (local use)
brew "bash"                   # Portable shell (remote compatibility)
brew "starship"               # Cross-shell prompt

# ------------------------------------------------------------------------------
# Terminal & Multiplexing
# ------------------------------------------------------------------------------
cask "alacritty"              # GPU-accelerated terminal emulator
brew "tmux"                   # Terminal multiplexer
cask "font-fira-code"         # Monospace font with ligatures
cask "font-jetbrains-mono"    # Alternative monospace font
cask "font-hack-nerd-font"    # Nerd Font for terminal icons

# ------------------------------------------------------------------------------
# Window Management
# ------------------------------------------------------------------------------
brew "koekeishiya/formulae/yabai"      # Tiling window manager
brew "koekeishiya/formulae/skhd"       # Hotkey daemon
tap "FelixKratz/formulae"              # SketchyBar tap
brew "FelixKratz/formulae/sketchybar"  # Custom menu bar
cask "karabiner-elements"              # Keyboard customization
cask "hammerspoon"                     # Automation engine
cask "ice"                             # Menu bar icon manager

